ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_rtdma_regs.xml
<module id="RTDMA_REGS" HW_revision="" description="RTDMA Registers">
	<register id="DMACTRL" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="DMA Control Register">
		<bitfield id="HARDRESET" description="Hard Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PRIORITYRESET" description="Priority Reset Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PRIORITYSEL" description="The priority select bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="DEBUGCTRL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Debug Control Register">
		<bitfield id="FREE" description="Debug Mode Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="REVISION" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="RTDMA Revision Control Register">
		<bitfield id="TYPE" description="RTDMA Type" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="REV" description="RTDMA Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="SWPRI1" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Software Priority Configuration Register 1">
		<bitfield id="CH1PRIORITY" description="Ch1 Priority Configuration" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CH2PRIORITY" description="Ch2 Priority Configuration" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CH3PRIORITY" description="Ch3 Priority Configuration" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="CH4PRIORITY" description="Ch4 Priority Configuration" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="CH5PRIORITY" description="Ch5 Priority Configuration" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="CH6PRIORITY" description="Ch6 Priority Configuration" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="CH7PRIORITY" description="Ch7 Priority Configuration" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="CH8PRIORITY" description="Ch8 Priority Configuration" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="SWPRI2" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Software Priority Configuration Register 2">
		<bitfield id="CH9PRIORITY" description="Ch9 Priority Configuration" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CH10PRIORITY" description="Ch10 Priority Configuration" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="PRIORITYSTAT" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="Priority Status Register">
		<bitfield id="ACTIVESTS" description="Active Channel Status Bits" begin="4" end="0" width="5" rwaccess="R"/>
		<bitfield id="ACTIVESTS_SHADOW" description="Active Channel Status Shadow Bits" begin="12" end="8" width="5" rwaccess="R"/>
	</register>
	<register id="DMACFG_LOCK" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="Channel Configuration Temporary Lock">
		<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DMACFG_COMMIT" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Channel Configuration Permanent Commit">
		<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
